---
kind: type
id: T:Autodesk.Revit.DB.Analysis.GenericZoneDomainData
source: html/c2c91032-f21e-f0b7-0c3b-73e720f42d68.htm
---
# Autodesk.Revit.DB.Analysis.GenericZoneDomainData

A base class for specific domain requirements for a generic zone.

## Syntax (C#)
```csharp
public class GenericZoneDomainData : IDisposable
```